Revit 2027 API
RebarHandlePositionData.GetBarGeometry Method
 Returns the geometry for a bar at the specified index currently in the Rebar.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<Curve> GetBarGeometry(
	int barIndex
)
Public Function GetBarGeometry (
	barIndex As Integer
) As IList(Of Curve)
public:
IList<Curve^>^ GetBarGeometry(
	int barIndex
)
member GetBarGeometry :
        barIndex : int -> IList<Curve>
Parameters
barIndex Int32
 The index of the bar. Should be a number between 0 and GetNumberOfBars() - 1.
Return Value
IList<Curve>
 Returns an array of curves that defines the bar at the specified index.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  barIndex is not in the range [ 0, GetNumberOfBars()-1 ].
See Also
Reference
RebarHandlePositionData Class
Autodesk.Revit.DB.Structure Namespace